from colorama import init
from colorama import Fore, Back, Style
init()

def banner():

    print(Fore.CYAN + '''\n				  █▀▀ █▀▀ █▄░█ █▀▀ █▀█ ▄▀█ ▀█▀ █▀█ █▀█ - version 0.1.9
				  █▄█ ██▄ █░▀█ ██▄ █▀▄ █▀█ ░█░ █▄█ █▀▄''')
    
    print(Fore.RESET + '''
	   					  ║
						  ║
	  					  ║	 
	 ╔════════════════════════════════════════╬══════════════════════════════════════╗
	 ║					  ║           				 ║
	 ║  					  ║					 ║
	 ║            		   	          ║                                      ║
 ╔════════════════════════════════╗ ╔════════════════════════════════╗ ╔═════════════════════════════════╗
 ║ [ 1 ] - Информация о софте 	  ║ ║ [ 7 ] - Генератор банк. карт   ║ ║ [ 13 ] - Генератор улиц 	 ║
 ║ [ 2 ] - Рандомайзер цифр       ║ ║ [ 8 ] - Генератор паролей      ║ ║ [ 14 ] - Генератор городов      ║
 ║ [ 3 ] - Генератор ру имён	  ║ ║ [ 9 ] - Генератор ссылок	     ║ ║ [ 15 ] - Генератор профессий    ║
 ║ [ 4 ] - Генератор фамилий	  ║ ║ [ 10 ] - Генератор ников       ║ ║ [ 16 ] - Генератор анекдотов	 ║
 ║ [ 5 ] - Генератор личностей	  ║ ║ [ 11 ] - Генератор почт	     ║ ║ [ 17 ] - ChatGPT 4	 	 ║
 ║ [ 6 ] - Рандомайзер от 1 до 10 ║ ║ [ 12 ] - Генератор тел.номеров ║ ║ [ 18 ] - Генератор QR-кодов     ║
 ╚════════════════════════════════╝ ╚════════════════════════════════╝ ╚═════════════════════════════════╝
 ╔═════════════════════════════════╗╔═════════════════════════════════╗╔═════════════════════════════════╗
 ║ [ 19 ] - Выход из программы     ║║ [ 24 ] - N/A                    ║║ [ 29 ] - N/A                    ║  
 ║ [ 20 ] - N/A                    ║║ [ 25 ] - N/A                    ║║ [ 30 ] - N/A                    ║
 ║ [ 21 ] - N/A                    ║║ [ 26 ] - N/A                    ║║ [ 31 ] - N/A                    ║                     
 ║ [ 22 ] - N/A                    ║║ [ 27 ] - N/A                    ║║ [ 32 ] - N/A                    ║
 ║ [ 23 ] - N/A                    ║║ [ 28 ] - N/A                    ║║ [ 33 ] - N/A                    ║
 ╚═════════════════════════════════╝╚═════════════════════════════════╝╚═════════════════════════════════╝''')
    