from colorama import init
from colorama import Fore, Back, Style
init()

def banner():

    print(Fore.CYAN + '''\n				  █▀▀ █▀▀ █▄░█ █▀▀ █▀█ ▄▀█ ▀█▀ █▀█ █▀█ - version 0.2.3
				  █▄█ ██▄ █░▀█ ██▄ █▀▄ █▀█ ░█░ █▄█ █▀▄''')
    
    print(Fore.RESET + '''
	  	 					  ║
							  ║
	  						  ║	 
		 ╔════════════════════════════════════════╬══════════════════════════════════════╗
		 ║					  ║           				 ║
		 ║  					  ║					 ║
		 ║            		   	          ║                                      ║
 	╔════════════════════════════════╗ ╔════════════════════════════════╗ ╔═════════════════════════════════╗
 	║ [ 1 ] - Информация           	 ║ ║ [ 7 ] - Генератор банк. карт   ║ ║ [ 13 ] - Генератор улиц         ║
 	║ [ 2 ] - Рандомайзер чисел      ║ ║ [ 8 ] - Генератор паролей      ║ ║ [ 14 ] - Генератор городов   	║
 	║ [ 3 ] - Генератор имен         ║ ║ [ 9 ] - Генератор ссылок       ║ ║ [ 15 ] - Генератор профессий 	║
 	║ [ 4 ] - Генератор фамилий      ║ ║ [ 10 ] - Генератор ников       ║ ║ [ 16 ] - Генератор анекдотов 	║
 	║ [ 5 ] - Генератор личностей    ║ ║ [ 11 ] - Генератор почт        ║ ║ [ 17 ] - ChatGPT 4         	║
 	║ [ 6 ] - Рандомайзер 1-10       ║ ║ [ 12 ] - Генератор телефонов   ║ ║ [ 18 ] - Генератор QR-кодов  	║
 	╚════════════════════════════════╝ ╚════════════════════════════════╝ ╚═════════════════════════════════╝
 	╔═════════════════════════════════╗╔═════════════════════════════════╗╔═════════════════════════════════╗
 	║ [ 19 ] - Генератор дат          ║║ [ 25 ] - N/A                    ║║ [ 31 ] - N/A                    ║  
 	║ [ 20 ] - Генератор решений      ║║ [ 26 ] - N/A                    ║║ [ 32 ] - N/A                   	║
 	║ [ 21 ] - Генератор персонажей   ║║ [ 27 ] - N/A             	     ║║ [ 33 ] - N/A                   	║
    	║ [ 22 ] - Генератор NFT-имен     ║║ [ 28 ] - N/A		     ║║ [ 34 ] - N/A			║                     
 	║ [ 23 ] - Генератор сборки пк    ║║ [ 29 ] - N/A          	     ║║ [ 35 ] - N/A                   	║
 	║ [ 24 ] - Выход из программы     ║║ [ 30 ] - N/A              	     ║║ [ 36 ] - N/A                   	║
 	╚═════════════════════════════════╝╚═════════════════════════════════╝╚═════════════════════════════════╝''')
    

banner()
    
