# -------------------------------------- Персонажи --------------------------------------

first_person = '''Имя: Эралин Ветрокрылая 
Описание: Эльфийка-друид с волосами цвета осенней листвы и глазами, меняющими оттенок с рассветом. Носит плащ из паутины и коры.
Что умеет делать:  Управлять ветром и листьями, превращаться в стаю птиц, предсказывать погоду по узорам на воде.'''

second_person = '''Имя: Тео "Шторм" Вектор
Описание: Киборг-хакер с голубой неоновой подсветкой вдоль тела. Его левая рука — модульный гаджет, адаптирующийся под любые технологии.
Что умеет делать: Взламывать системы за секунды, генерировать электромагнитные импульсы, сливаться с цифровыми интерфейсами.'''

thir_person = '''Имя: Лорелея Огненный Вкус
Описание: Повар-алхимик с татуировками рецептов на руках. Её кухня — лаборатория с котлами, где кипят разноцветные зелья.
Что умеет: Создавать блюда, дающие сверхспособности (например, суп невидимости), оживлять кулинарные ингредиенты.     '''

fourth = '''Имя: Кайл Ночной Шепот
Описание: Сирота с питомцем-тенью, который принимает форму пантеры. Говорит монотонно и избегает солнечного света.
Что умеет: Проходить сквозь стены как тень, вызывать иллюзии страха, разговаривать с ночными животными.    '''

hfift = '''Имя: Серафина Лунный След
Описание: Астролог-мечтательница в платье из звёздной пыли. Её волосы мерцают, как Млечный Путь.
Что умеет: Читать судьбы по созвездиям, материализовывать фрагменты снов, летать на астральном ветре.'''

sixth = '''Имя: Зефир-7
Описание: Робот-поэт с корпусом из матового серебра. Вместо сердца у него калейдоскоп, а на груди — экран с эмодзи.
Что умеет: Сочинять стихи, меняющие настроение слушателей, преобразовывать эмоции в музыку, взламывать скуку.'''

seventh = '''Имя: Капитан Игнатий Морской Глаз
Описание: Пират-чародей с бородой из водорослей и деревянной рукой, покрытой рунами. Его корабль плывёт без ветра.
Что умеет: Управлять морскими течениями, вызывать штормы, дышать под водой как рыба.'''

eighth = '''Имя: Трикси Болтблум
Описание: Фея-механик с крыльями из шестерёнок. Живет в гигантском цветке, который работает как генератор энергии.
Что умеет: Чинить любую технику магией, создавать устройства из растений, взрывать болты с помощью смеха.'''

ninth = '''Имя: Дориан Тень-Следопыт
Описание: Детектив-некромант в потрёпанном плаще. Его трость светится вблизи призраков.
Что умеет: Задавать вопросы мёртвым, читать "воспоминания" предметов, исчезать в клубах чёрного дыма.'''

tenth = '''Имя: Алисия Тик-Так
Описание: Девочка 10 лет с карманными часами, которые вросли в её ладонь. Говорит, что «время шепчет ей секреты».
Что умеет: Останавливать время на 10 секунд, ускорять собственное восприятие, но за каждое использование стареет на день.'''

eleven = '''Имя: Гримм Ржавый Шестерня
Описание: Инженер-стимпанкер с медными очками и механической рукой, из которой валит пар. Носит плащ из старых карт и шестерёнок.
Что умеет: Создавать машины на древней магии пара, оживлять металлолом, находить выходы из лабиринтов по звуку шепота механизмов. '''

twelve = '''Имя: Вейла Ледяной Шёпот
Описание: Следопыт из северных пустошей с волосами белее снега и голубой татуировкой в виде ледника на лице. Её дыхание оставляет иней.
Что умеет: Замораживать время на 3 секунды, создавать ледяных клонов, слышать голоса затерянных во льдах душ.'''

thirteen = '''Имя: Озрик Песочный Алхимик
Описание: Бродячий учёный с мешками песка за спиной. Его кожа покрыта узорами, как древние фрески, а глаза мерцают, как пустынные звёзды.
Что умеет: Превращать песок в воду, вызывать песчаных демонов, читать будущее по дюнам.'''

fourteen = '''Имя: Люсиферра Светоносная
Описание: Ангел-мятежник с обгоревшими крыльями и мечом из солнечного света. Её аура ослепляет тех, кто лжёт.
Что умеет: Управлять светом как оружием, исцелять раны ценой собственных воспоминаний, летать сквозь стены.'''

fifteen = '''Имя: Крипто "Глаз Бури"
Описание: Мутант с кожей, покрытой радужной чешуёй, и глазами без зрачков. Говорит эхом и питается электричеством.
Что умеет: Поглощать энергию взрывов, видеть сквозь время на 5 минут вперёд, превращаться в токсичный туман.'''

sixteen = '''Имя: Морриган Чёрный Корень
Описание: Друидка-отшельница, чьё тело сплетено из корней и грибов. Вместо волос — плющ, в котором живут светлячки.
Что умеет: Управлять ростом растений-хищников, общаться с грибным разумом, превращаться в болотную трясину.'''

seventeen = '''Имя: Зориан Звёздный Скиталец
Описание: Астронавт, застрявший между измерениями. Его скафандр покрыт неизвестными символами, а внутри шлема — бесконечная галактика.
Что умеет: Создавать червоточины размером с ладонь, дышать в вакууме, притягивать метеоритный дождь.'''

eighteen = '''Имя: Никс "Тень Смеха"
Описание: Шут с лицом, скрытым за маской из перьев вороны. Его тень смеётся отдельно от него и крадёт мелкие предметы.
Что умеет: Управлять эмоциями через смех, телепортироваться в пределах видимости своей тени, превращать страх в физические ловушки.'''

nineteen = '''Имя: Элайра Песня Ветра
Описание: Бард-сирена с арфой из коралла и голосом, от которого дрожит земля. Её волосы переливаются, как океанская волна.
Что умеет: Усмирять штормы музыкой, вызывать галлюцинации звуком, говорить на языке китов.'''

twenty = '''Имя: Вулкан Живая Батарея
Описание: Подросток-киборг с огненными волосами и проводами вместо вен. Его тело заряжается от молний и ядерных отходов.
Что умеет: Стрелять плазмой из рук, взламывать электронику прикосновением, взрываться и восстанавливаться за 10 секунд.'''

twenty_one = '''Имя: Сильван Коготь Луны
Описание: Оборотень-аристократ с серебряным кольцом, подавляющим трансформацию. Его тень всегда в форме волка.
Что умеет: Чуять предательство за километр, сливаться с лунным светом, призывать стаю призрачных волков.'''

twenty_two = '''Имя: Ирис Глаз Пустоты
Описание: Слепая пророчица с чёрной повязкой на глазах. На её ладонях — россыпь звёзд, которые складываются в узоры-предсказания.
Что умеет: Видеть прошлое через прикосновение, открывать порталы в параллельные миры, лишать голосов тех, кто ей лжёт.'''

twenty_three = '''Имя: Рекс Плазменный Кузнец
Описание: Инопланетный кузнец с кожей цвета расплавленного металла. Куёт оружие из нейтронных звёзд и чёрных дыр.
Что умеет: Создавать гравитационные аномалии, поглощать любые металлы для ремонта тела, летать на плазменной наковальне.'''

twenty_four = '''Имя: Лира Серебряная Нить
Описание: Шпионка с волосами из жидкого металла. Её костюм меняет цвет и текстуру, маскируя её под окружение.
Что умеет: Превращаться в ртуть, чтобы просачиваться в щели, оставлять невидимые ловушки из нитей, подслушивать разговоры через вибрации воздуха.'''

twenty_five = '''Имя: Кассио Пожиратель Звуков
Описание: Существо без рта, с ушами размером с ладонь. Питается музыкой и криками, носит мантию из тишины.
Что умеет: Создавать зоны абсолютной тишины, усиливать звуки до разрушительных частот, оживлять эхо.'''

twenty_six = '''Имя: Фэй "Двойное Пламя"
Описание: Девушка с двумя сердцами: одно горит, как солнце, другое холоднее льда. Её слезы превращаются в драгоценные камни.
Что умеет: Управлять огнём и морозом одновременно, воскрешать себя ценой потери памяти, видеть ауры живых существ.'''

twenty_seven = '''Имя: Гораций Каменный Шут
Описание: Голем с лицом клоуна, высеченным из гранита. Его шутки материализуются в каменные скульптуры.
Что умеет: Превращать слова в физические объекты, взрываться на осколки и собираться заново, имитировать голоса других.'''

twenty_eight = '''Имя: Нимфаэль Роса Утра
Описание: Дух весны с крыльями из лепестков и телом, сотканным из тумана. Там, где она ступает, распускаются цветы.
Что умеет: Ускорять рост живых существ, лечить болезни росой, превращаться в солнечный луч.'''

twenty_nine = '''Имя: Доктор Вортигон
Описание: Безумный учёный с третьим глазом во лбу. Его лаборатория — живой корабль из плоти и техники.
Что умеет: Создавать гибридов животных и машин, читать мысли через электрические импульсы, регенерировать потерянные конечности.'''

thirty = '''Имя: Зара Кровавый Мёд
Описание: Пчеловод-вампир с ульями, где пчёлы пьют кровь. Её мёд дарует бессмертие, но вызывает безумие.
Что умеет: Контролировать рои пчёл-убийц, превращаться в облако насекомых, чувствовать страх как сладкий аромат.'''

thirty_one = '''Имя: Октавиан "Сломанное Зеркало"
Описание: Странник в плаще из осколков зеркал, которые отражают чужие воспоминания. Его лицо всегда скрыто, а голос звучит как эхо из разных реальностей.
Что умеет: Создавать порталы через зеркала, подменять чужие воспоминания своими, разбивать иллюзии ударом по отражению. '''

thirty_two = '''Имя: Веридиана Шепот Корней
Описание: Девушка с кожей, покрытой корой, и волосами из спутанных лиан. Её сердце бьётся в такт ритму древнего леса.
Что умеет: Управлять деревьями как щупальцами, превращаться в цветущий куст, слышать мысли через корневую сеть планеты.'''

thirty_three = '''Имя: Кайро "Часовой Тик"
Описание: Бродячий часовщик с карманными часами вместо левого глаза. Время вокруг него течёт на 10% медленнее.
Что умеет: Перематывать события на 30 секунд назад, ускорять старение предметов, находить "трещины во времени" для побега.'''

thirty_four = '''Имя: Серена Клинок Шёпота
Описание: Ниндзя-невидимка, чьё тело растворяется в тишине. Её оружие — иглы из замороженного звука.
Что умеет: Исчезать при громких звуках, убивать одним шёпотом, создавать клоны из акустических волн.'''

thirty_five = '''Имя: Дарквелл "Жнец Снов"
Описание: Мрачный коллекционер с мешком, где хранятся украденные сны. Его пальцы длинны и полупрозрачны, как дым.
Что умеет: Погружать жертв в вечный кошмар, превращать сны в физические объекты, находить спящих на расстоянии.'''

thirty_six = '''Имя: Люми "Светлячок-Хакер"
Описание: Девочка-гений с нейронным имплантом в виде светящегося светлячка на шее. Её глаза мерцают бинарным кодом.
Что умеет: Взламывать разум через зрительный контакт, создавать голограммы из мусора, заряжаться от Wi-Fi-сигналов.'''

thirty_seven = '''Имя: Граф Орлович Тенейед
Описание: Аристократ-вампир, питающийся не кровью, а чужими страхами. Его тень живет отдельно и пожирает свет.
Что умеет: Материализовывать кошмары жертв, превращаться в стаю летучих мышей из пепла, контролировать тьму.'''

thirty_eight = '''Имя: Зигги Ртутный Бард
Описание: Музыкант с виолончелью, струны которой сделаны из жидкого металла. Его мелодии оставляют ожоги на коже.
Что умеет: Плавь металл звуком, вызывать землетрясения низкими нотами, гипнотизировать ритмом сердца.'''

thirty_nine = '''Имя: Некра "Пожирательница Имён"
Описание: Демоница с книгой, куда вписаны украденные имена. Без имени жертва теряет память и силу.
Что умеет: Стирать имена из реальности, воскрешать мертвых, давая им новые имена, находить слабые места через истинное имя.'''

forty = '''Имя: Профессор Квентин Квантум
Описание: Учёный, застрявший в суперпозиции: его тело мерцает, как голограмма, и существует в 3-х местах одновременно.
Что умеет: Делиться на клонов-призраков, проходить сквозь материю, взрываться и собираться заново через квантовые поля.'''


list = [first_person, second_person, thir_person, fourth, hfift, sixth, seventh, eighth, ninth, tenth, eleven, twelve, thirteen, fourteen, fifteen, sixteen, seventeen, eighteen, nineteen, twenty, twenty_one, twenty_two, twenty_three, twenty_four, twenty_five, twenty_six, twenty_seven, twenty_eight, twenty_nine, 
        thirty, thirty_one, thirty_two, thirty_three, thirty_five, thirty_six, thirty_seven, thirty_eight, thirty_nine, forty]


# -------------------------------------- NFT --------------------------------------

nft = 'Neon Reverie 42' 
nft1 = 'Quantum Glyphs: Chapter VII'
nft2 = 'ChronoMist Unbound'
nft3 = 'Etheral Bloom (Genesis Series)'
nft4 = 'SynthSovereign’s Crown'
nft5 = 'Fragments of Hypernova'
nft6 = 'Deus Ex Machina: Protocol'
nft7 = 'Celestial Glitch'
nft8 = 'Voidborn Oracles'
nft9 = 'Psyber Hieroglyph Alpha'
nft10 = 'Stellar Asylum'
nft11 = 'Nebula’s Whisper'
nft12 = 'Dark Matter Diaries'
nft13 = 'Pulsar Nomad'
nft14 = 'ExoPrism Protocol'
nft15 = 'NeuroFractal v3.14'
nft16 = 'BioLumen Genesis'
nft17 = 'SynthJungle Canopy'
nft18 = 'Post-Human Idol'
nft19 = 'Rune.exe'
nft20 = 'Neon Coral Reef'
nft21 = 'NeuroNocturne'
nft21 = 'AI Apocrypha'
nft22 = 'Zero.Gravity Saints'
nft23 = 'Dystopian Pantheon'
nft24 = 'Codex Seraphim'
nft25 = 'Hivemind Fragments'
nft26 = 'Echoes from Layer 2'
nft27 = 'Quantum Cathedrals'
nft28 = 'Ghosts in the Shell (2024 Remix)'
nft29 = 'Deus Algorithm'
nft30 = 'Plasma Reverie'
nft31 = 'Silicon Sacrament'
nft32 = '404 Deities'
nft33 = 'Crypto Zen Garden'
nft34 = 'Singularity’s Kiss'
nft35 = 'Black Hole Sonata'
nft36 = 'Neon Kabbalah'
nft37 = 'Post-Human Relics'
nft38 = 'Chaos Theory Couture'
nft39 = 'Metaverse Mausoleum'
nft40 = 'Digital Alchemy'
nft41 = 'Synthetic Symbiosis'
nft42 = 'Ethergeist Manifesto'
nft43 = 'Void Protocol'
nft44 = 'Pixel Prophets'
nft45 = 'AI Dream Diaries'
nft46 = 'Cyber Rosetta Stone'
nft47 = 'Neural Nirvan'
nft48 = 'Oracles of Override'
nft49 = 'Glitch Messiah'
nft50 = 'NFTarot Cards'
nft51 = 'Decentralized DNA'
nft52 = 'Lucid Datastreams'
nft53 = 'Hacked Hierophants'
nft54 = 'Solaris Protocol'
nft55 = 'Crypto Chiaroscuro'
nft56 = 'Quantum Quarantine'
nft57 = 'Déjà Vu DAO'
nft58 = 'Electric Mandala'
nft59 = 'Fermi Paradox NFT'
nft60 = 'Ex Machina Eucharist'
nft61 = 'Zen.zero'
nft62 = 'Retro-Future Fossils'
nft63 = 'Astral Algorithm'
nft64 = 'Blockchain Banshee'
nft65 = 'Neon Necromancy'
nft66 = 'Singularity’s Shadow'
nft67 = 'Ethernomicon'
nft68 = 'Cyber Satori'
nft69 = 'The Last Smart Contract'

nft_list = [nft, nft1, nft2, nft3, nft4, nft5, nft6, nft7, nft8, nft9, nft10, nft11, nft12, nft13, nft14, nft15, nft16, nft17, nft18, nft19, nft20, nft21, nft22, nft23, nft24, nft25, nft26, nft27, nft28, nft29, nft30, nft31, nft32, nft33, nft34, nft35, nft36, nft37, nft38, nft39, nft40,
            nft41, nft42, nft43, nft44, nft45, nft46, nft47, nft48, nft49, nft50, nft51, nft52, nft53, nft54, nft55, nft56, nft57, nft58, nft59, nft60,nft61, nft62, nft63, nft64, nft65, nft66, nft67, nft68, nft69]